load-test-script/load-test-off-peak.yml
config:
  target: "https://7jw4oebppb.execute-api.ap-southeast-1.amazonaws.com/Prod"
  phases:
    - duration: 5
      arrivalRate: 1
      name: "Off-peak"
  defaults:
    headers:
      Authorization: Basic c29tZS1hcGktdG9rZW46
  payload:
    path: "rev_payload.csv"
    cast: false
    fields:
      - "passengerId"
      - "startLocationN"
      - "startLocationW"
      - "endLocationN"
      - "endLocationW"
      - "driverId"
scenarios:
  - flow:
  #Rider update location
    - put:
        url: "/riders/{{ passengerId }}/locations"
        json:
          currentLocation:
            N: "{{ startLocationN }}"
            W: "{{ startLocationW }}"
  #Rider get location
    - get:
        url: "/riders/{{ passengerId }}"
  #Book new ride
    - put:
        url: "/rides/"
        json:
          bookingLocation:
            N: "{{ startLocationN }}"
            W: "{{ startLocationW }}"
          targetLocation:
            N: "{{ endLocationN }}"
            W: "{{ endLocationW }}"
  #Return acceptatble rides
    - get:
        url: "/drivers/{{ driverId }}/rides/acceptable"
  #Get pending ride info
    - get:
        url: "/rides/{{ rideId }}"
  #Driver accept ride
    - put:
        url: "/drivers/{{ driverId }}/rides/{{ rideId }}/accept"
        json:
          acceptLocation:
            N: "{{ endLocationN }}"
            W: "{{ endLocationW }}"
  #Get accepted ride info
    - get:
        url: "/rides/{{ rideId }}"
  #Driver update location
    - put:
        url: "/drivers/{{ driverId }}/locations"
        json:
          updatedLocation:
            N: "{{ endLocationN }}"
            W: "{{ endLocationW }}"
  #Driver get location
    - get:
        url: "/drivers/{{ driverId }}"
  #Get Distance
    - get:
        url: "/drivers/{{ driverId }}/distance"
  #Driver update location near passenger
    - put:
        url: "/drivers/{{ driverId }}/locations"
        json:
          updatedLocation:
            N: "{{ startLocationN }}" + 0.00232
            W: "{{ startLocationW }}" + 0.00232
  #Get in progress ride info  
    - get:
        url: "/rides/{{ rideId }}"
  #Driver update location near target
    - put:
        url: "/drivers/{{ driverId }}/locations"
        json:
          updatedLocation:
            N: "{{ endLocationN }}"
            W: "{{ endLocationW }}"
  #Get complete success ride info
    - get:
        url: "/rides/{{ rideId }}"